// src/data/surveyData.js

/* ===========================================================
   PHQ-9 (공식 문항)
   출처: Kroenke, Spitzer, & Williams, 2001
   =========================================================== */
export const PHQ = [
  "기분이 가라앉거나 우울하거나 희망이 없다고 느꼈다.",
  "평소 하던 일에 대한 흥미가 없어지거나 즐거움을 느끼지 못했다. .",
  "잠들기가 어렵거나 자주 깼다. / 혹은 너무 많이 잤다.",
  "평소보다 식욕이 줄었다. / 혹은 평소보다 많이 먹었다.",
  "다른 사람들이 눈치 챌 정도로 평소보다 말과 행동이 느려졌다. / 너무 안절부절 못해서 가만히 있을 수가 없다.",
  "피곤하고 기운이 없었다.",
  "내가 잘못했거나, 실패했다는 생각이 들었다. / 혹은 자신과 가족을 실망시켰다고 생각했다.",
  "신문을 읽거나 TV를 보는 것과 같은 일상적인 일에도 집중할 수가 없었다.",
  "차라리 죽는 것이 더 낫겠다고 생각했다. / 혹은 자해할 생각을 했다"
];

/* ===========================================================
   GAD-7 (공식 문항)
   출처: Spitzer, Kroenke, Williams & Löwe, 2006
   =========================================================== */
export const GAD = [
  "초조하거나 불안하거나 조마조마하게 느낀다.",
  "걱정하는 것을 멈추거나 조절할 수가 없다",
  "여러 가지 것들에 대해 걱정을 너무 많이 한다",
  "편하게 있기 어렵다",
  "너무 안절부절 못해서 가만히 있기 힘들다",
  "쉽게 짜증이 나거나 쉽게 성을 내게 된다",
  "마치 큰일이 생길 것처럼 두렵게 느껴진다"
];

/* ===========================================================
   PSS-10 (공식 문항)
   출처: Cohen, S., Kamarck, T., & Mermelstein, R. (1983)
   =========================================================== */
export const PSS = [
  "최근 1개월 동안, 예기치 못했던 일 때문에 당황한 적이 얼마나 있었습니까?",
  "최근 1개월 동안, 인생에서 중요한 일들을 조절할 수 없었다는 느낌을 얼마나 경험하였습니까?",
  "최근 1개월 동안, 신경이 예민해지고 스트레스를 받고 있다는 느낌을 얼마나 경험하였습니까?",
  "최근 1개월 동안, 개인 적인 문제들을 다루는데 있어 얼마나 자신감을 느끼셨습니까?",
  "최근 1개월 동안, 일상의 일들이 생각대로 진행되고 있다는 느낌을 얼마나 경험하였습니까?",
  "최근 1개월 동안, 해야 하는 일을 처리할 수 없다고 생각한 적이 얼마나 있었습니까?",
  "최근 1개월 동안, 일상에서의 짜증을 얼마나 자주 잘 다스릴 수 있었습니까?",
  "최근 1개월 동안, 최상의 컨디션이라고 얼마나 자주 느끼셨습니까?",
  "최근 1개월 동안, 당신이 통제할 수 없는 일 때문에 화가 난 경험이 얼마나 있었습니까?",
  "최근 1개월 동안, 어려운 일들이 너무 많이 쌓여 극복하지 못할 것 같았던 느낌을 얼마나 자주 경험하셨습니까?"
];
